//=============================================================================
// HUD de Alpha変更　Toggle式 トランスミッター用スクリプト v0.1.0
// ----------------------------------------------------------------------------
// (C)2021 Enhanced System
// This software is released under the MIT License.
// http://opensource.org/licenses/mit-license.php
// ----------------------------------------------------------------------------
// Version
// 0.1.0 2021/05/19 β版
// ----------------------------------------------------------------------------
// [GitHub] : https://github.com/izumotoWorks/linden_scripts
//=============================================================================

// ----------------------------------------------------------------------------
// 定数定義　
// ----------------------------------------------------------------------------
float C_VISIBLE = 1.000000; // 不透明度
float C_HIDE = 0.000000; // 透明度

vector LEFT_TOP_RANGE = <0.00000, 1.00000, 0.00000>; // 左上座標
vector RIGHT_BOTTOM_RANGE = <0.64162, 0.30588, 0.00000>; // 右上座標

// 送信するチャンネル
integer SEND_CHANNEL  = -114931; // 値を変更する際はレシーバー側も変更する必要あり


// ----------------------------------------------------------------------------
// 変数定義　
// ----------------------------------------------------------------------------

// 位置保存変数
vector touch_pos;

// 範囲変数
vector leftTop;
vector rightBottom;
// 範囲かどうかのフラグ
integer inRange = -1;
// 透明フラグ
integer alpha_flag = -1;


// ----------------------------------------------------------------------------
// 自作関数群
// ----------------------------------------------------------------------------
// アルファ値を反転させる
float nl_toggle_alpha() {
    if(alpha_flag == 1)  {
        alpha_flag = -1;
        return C_HIDE;
    } else {
        alpha_flag = 1;
        return C_VISIBLE;
    }
}


// ----------------------------------------------------------------------------
// メイン関数
// ----------------------------------------------------------------------------

default
{
    // タッチされ終わったら動く関数
    touch_end(integer total_number)
    {
        // 座標を取得
        touch_pos = llDetectedTouchST(0);

        // 座標が範囲内か調べる
        if(
            touch_pos.x >= LEFT_TOP_RANGE.x　&&
            touch_pos.x <= RIGHT_BOTTOM_RANGE.x &&
            touch_pos.y <= LEFT_TOP_RANGE.y &&
            touch_pos.y >= RIGHT_BOTTOM_RANGE.y
        ) {
            inRange = 1;
        } else {
            inRange = -1;
        }

        // 範囲であれば処理する
        if(inRange == 1) {
            // アルファを反転させる
            float now_alpha = nl_toggle_alpha();

            // レシーバーにタッチした値を送信する(同じチャンネルリッスン且つ10m以内の対象に送信)
            llWhisper( SEND_CHANNEL, (string)now_alpha);

        }

        // // テキストを消す
        // llSetText("", <1.0, 1.0, 1.0>, 1.0);
    }
}
